WebServiceDataset/finder/book/service10.Accounts.wsdl

<?xml version="1.0"?>
<definitions name="BNQuoteService" targetNamespace="http://www.xmethods.net/sd/BNQuoteService.wsdl" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.xmethods.net/sd/BNQuoteService.wsdl" >
	<message name="getPriceRequest">
		<part name="isbn" type="xsd:string"/>
	</message>
	<message name="getPriceResponse">
		<part name="return" type="xsd:float"/>
	</message>
	<portType name="BNQuotePortType">
		<operation name="getPrice">
			<input message="tns:getPriceRequest" name="getPrice"/>
			<output message="tns:getPriceResponse" name="getPriceResponse"/>
		</operation>
	</portType>
	<binding name="BNQuoteBinding" type="tns:BNQuotePortType">
		<soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="getPrice">
			<soap:operation soapAction=""/>
			<input>
				<soap:body use="encoded" namespace="urn:xmethods-BNPriceCheck" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
			</input>
			<output>
				<soap:body use="encoded" namespace="urn:xmethods-BNPriceCheck" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
			</output>
		</operation>
	</binding>
	<service name="BNQuoteService">
		<documentation>Returns price of a book at BN.com given an ISBN number</documentation>
		<port name="BNQuotePort" binding="tns:BNQuoteBinding">
			<soap:address location="http://services.xmethods.net:80/soap/servlet/rpcrouter"/>
		</port>
	</service>
</definitions>
